       IDENTIFICATION DIVISION.
       PROGRAM-ID. CALCULATE.
       DATA DIVISION.
       LINKAGE SECTION.
       01 LS-NUMBER-OF-SHARES PIC 9(5).
       01 LS-CLOSING-PRICE PIC 9(4)V99.
       01 LS-ADJUSTED-COST-BASE PIC 9(5)V99.
       01 LS-MARKET-VALUE PIC 9(5)V99.
       01 LS-TOTAL-GAIN-OR-LOSS PIC 9(5)V99-.
       PROCEDURE DIVISION USING LS-NUMBER-OF-SHARES LS-CLOSING-PRICE
            LS-ADJUSTED-COST-BASE LS-MARKET-VALUE LS-TOTAL-GAIN-OR-LOSS.
           COMPUTE LS-MARKET-VALUE =
            LS-NUMBER-OF-SHARES * LS-CLOSING-PRICE.
           SUBTRACT LS-ADJUSTED-COST-BASE FROM LS-MARKET-VALUE
           GIVING LS-TOTAL-GAIN-OR-LOSS.
           EXIT PROGRAM.
       END PROGRAM CALCULATE.
